Repository: abe2602/personal_diary
Catalog: lib/l10n/intl_*.arb
Languages: pt_br

# secondaryTitle
source: your best friend
pt_br: seu melhor amigo

# genericErrorPrimaryText
source: Something wrong happened!
pt_br: Alguma coisa de errada aconteceu!

# genericErrorSecondaryText
source: Please, try again later.
pt_br: Por favor, tente novamente mais tarde.

# tryAgainButtonLabel
source: Try Again
pt_br: Tente Novamente

# noInternetMessage
source: Looks like there's no internet , Try to connect into internet ;)
pt_br: Parece que você está sem internet! , Tente conectar-se em alguma rede! ;)

# emptyFieldError
source: Empty Field
pt_br: Campo Vazio

# invalidFieldError
source: Invalid Field
pt_br: Formato Invalido

# signInInvalidPasswordErrorLabel
source: Invalid password format
pt_br: Formato da senha inválido

# signInEmptyPasswordErrorLabel
source: Empty password field
pt_br: Campo de senha vazio

# signInPasswordFieldLabel
source: Password
pt_br: Senha

# signInLabel
source: SIGN IN
pt_br: ENTRAR

# signInFirstAccess
source: FIRST ACCESS
pt_br: PRIMEIRO ACESSO

# signInPageInvalidCredentialsError
source: Seems like your password is wrong!
pt_br: A senha parece não estar correta!

# signInPageTryAgainText
source: Please, try again with another password.
pt_br: Por favor, tente uma nova senha!

# signInPageNoUserCreatedError
source: Seems like its your first time around here!
pt_br: Não há nenhum usuário criado.

# signInPageNoUserCreatedErrorTryAgainText
source: Please, Sign Up to proceed.
pt_br: Por favor, cadastre-se antes de tentar usar!

# signUpUsernameFieldLabel
source: Username
pt_br: Usuário

# signUpInvalidUsernameErrorLabel
source: Invalid username format
pt_br: Formato do usuário inválido

# signUpEmptyUsernameErrorLabel
source: Empty username field
pt_br: Campo de usuário vazio

# signUpInvalidPasswordErrorLabel
source: Invalid password format
pt_br: Formato da senha inválido

# signUpEmptyPasswordErrorLabel
source: Empty password field
pt_br: Campo de senha vazio

# signUpPasswordFieldLabel
source: Password
pt_br: Senha

# signUpPasswordsDifferErrorLabel
source: Passwords are different
pt_br: Senhas são diferentes

# signUpConfirmPasswordFieldLabel
source: Confirm Password
pt_br: Confirme a senha

# signUpAttentionText
source: ATTENTION!
pt_br: ATENÇÃO!

# signUpRememberPasswordText
source: * Write down your password, you cannot recover it!
pt_br: * Anote bem a sua senha, ela NÃO PODE ser recuperada!

# signUpMaxNameLengthText
source: * MAXIMUM Username length is 100!
pt_br: * Tamanho MÁXIMO para o nome é de 100 letras!

# signUpMaxPasswordLengthText
source: * Password length MUST be 6!
pt_br: * Senha deve ser composta de 6 números!

# signUpFinalizeLabel
source: CONFIRM
pt_br: FINALIZAR

# signUpPageLabel
source: Sign Up
pt_br: Cadastre-se
